## Plan Result (client-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/202521)



<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_wafv2_ip_set.AllowlistIPs
  * aws_wafv2_web_acl.ClientAPI-waf



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_wafv2_ip_set.AllowlistIPs will be created
  + resource "aws_wafv2_ip_set" "AllowlistIPs" {
      + addresses          = [
          + "34.226.66.3/32",
          + "52.0.226.89/32",
          + "52.54.7.21/32",
          + "54.198.114.156/32",
        ]
      + arn                = (known after apply)
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "ClientAPI-Prod-AllowList"
      + scope              = "REGIONAL"
      + tags               = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-clientapi"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "ClientAPI"
        }
      + tags_all           = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-clientapi"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "ClientAPI"
        }
    }

  # aws_wafv2_web_acl.ClientAPI-waf will be created
  + resource "aws_wafv2_web_acl" "ClientAPI-waf" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "Waf for client-api-proxy Prod environment"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "ClientAPI-waf-Prod"
      + scope                       = "REGIONAL"
      + tags_all                    = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-clientapi"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "ClientAPI"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "ClientAPI-Prod-ipAllowList"
          + priority = 1

          + action {
              + allow {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "ClientAPI-Prod-ipAllowList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "ClientAPI-Prod-RegionalRateLimit"
          + priority = 2

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "ClientAPI-Prod-RegionalRateLimit"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "ClientAPI-waf-Prod"
          + sampled_requests_enabled   = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"b2fed200-bfa7-4e24-897e-bdfa330b930c","JobName":"client-api_infrastructure_plan_prod","PRNumber":578,"Program":"tfcmt","SHA1":"5e68420d1cfb355241fcf1df18e9e465d2109214","Target":"client-api-cdk","Vars":{}} -->